part1_1.html
<!doctype html>
<html lang="en">
<head>
<title>Baustein 1 Meeting 1</title>
<!-- 2019-05-17 Fri 00:20 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">
<meta name="author" content="Falco Winkler">

<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">
</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-9"><h1 class="title">Baustein 1 Meeting 1</h1>
<p>
Baustein 1 Meeting 1: Hello World, Datentypen, Variablen, Verzweigungen und Schleifen
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Hello World</h2>
<div class="outline-text-2" id="text-1">
<p>
Beim Lernen von Programmiersprachen ist es eine weit verbreitete Tradition, als Erstes ein Programm zu schreiben, welches einfach nur hello world ausgibt. Diese Tradition wollen wir natürlich nicht brechen, außer dass wir es auf die Hamburger Art machen.
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #a626a4;">print</span>(<span style="color: #50a14f;">"Moin world"</span>)
</pre>
</div>

<pre class="example">
Moin world

</pre>

<p>
Führt man diese Codezeile in Thonny aus, erscheint die ausgabe in einem separaten Fenster namens "Shell". Die shell ist eine rein textuelle Benutzeroberfläche: Der Computer kann hier Ausgaben reinschreiben, und auch der Nutzer kann text eingeben (das lernen wir später kennen).
</p>

<p>
print ist eine Funktion, das bedeutet das der Print-Aufruf ein bestimmtes Verhalten auslöst. Funktionen werden wir später genauer kennen lernen, und wir werden auch eigene Funktionen schreiben.
</p>

<p>
Weiterhin ist print eine sogenannte Built-In Funktion, d.h. sie ist ein fester Bestandteil der Programmiersprache Python und ihr könnt jederzeit auf sie zugreifen. Sie gibt das Funktionsargument auf der Konsole ("Shell" in Thonny) aus. Es gibt <a href="https://docs.python.org/3/library/functions.html">eine Vielzahl von built-in Funktionen</a>, einige davon werden wir auch noch im Kurs kennenlernen.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Datentypen</h2>
<div class="outline-text-2" id="text-2">
<p>
"Moin world" ist mit Gänsefüßchen abgetrennt. Das bedeutet, dass "Moin world" Daten in Form einer Zeichenkette sind. Daten können als Literale (dh. explizit in das python-programm reingeschrieben, wie in diesem Fall) vorliegen. Oder sie können aus Funktionsaufrufen erhalten oder importiert werden (dazu später mehr). Es gibt auch Daten in Form von Zahlen. Die Literale dazu sehen dann so aus:
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #a626a4;">print</span>(1)   <span style="color: #a0a1a7; font-weight: bold;"># </span><span style="color: #a0a1a7;">Das ist eine Ganzzahl, ein sog. Integer</span>
<span style="color: #a626a4;">print</span>(1.2) <span style="color: #a0a1a7; font-weight: bold;"># </span><span style="color: #a0a1a7;">Das ist eine Kommazahl, ein sog. Float</span>
</pre>
</div>

<pre class="example">
1
1.2

</pre>

<p>
Es gibt noch ein paar weitere Datentypen in Python, die wir noch kennenlernen.
Mit der built-in Funktion type kann man sich jederzeit den typ zu einem Literal ausgeben lassen.
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #a626a4;">print</span>(<span style="color: #e44649;">type</span>(1))
<span style="color: #a626a4;">print</span>(<span style="color: #e44649;">type</span>(1.2))
</pre>
</div>

<pre class="example">
&lt;type 'int'&gt;
&lt;type 'float'&gt;

</pre>

<p>
(Tipp: In dem obigen code-block habe ich Funktionsaufrufe geschachtelt. Das kann man beliebig oft tun, geschachtelte Ausdrücke werden immer von innen nach aussen ausgewertet.)
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Variablen</h2>
<div class="outline-text-2" id="text-3">
<p>
Variablen sind ein weiterer wichtiger Bestandteil von Python - Programmen. Sie sind Platzhalter. Zum Beispiel können sie eine Zeichenkette oder Zahl als Wert enthalten. Werte von Variablen können sich mit der Zeit ändern. Sie werden mit der Schreibweise platzhaltername = wert deklariert. Variablennamen dürfen Buchstaben, Unterstriche und Zahlen enthalten (vobei das erste Zeichen des Variablennamens keine Zahl sein darf).
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #8b4513;">gru&#223;</span> = <span style="color: #50a14f;">"Moin"</span>
<span style="color: #8b4513;">name</span> = <span style="color: #50a14f;">"World"</span>

<span style="color: #a626a4;">print</span>(gru&#223;)   <span style="color: #a0a1a7; font-weight: bold;"># </span><span style="color: #a0a1a7;">Aktueller wert ist 'Moin'</span>
<span style="color: #a626a4;">print</span>(name)

<span style="color: #8b4513;">gru&#223;</span> = <span style="color: #50a14f;">"Hallo"</span> <span style="color: #a0a1a7; font-weight: bold;"># </span><span style="color: #a0a1a7;">Wert des Platzhalters wird hier ver&#228;ndert</span>

<span style="color: #a626a4;">print</span>(gru&#223;) <span style="color: #a0a1a7; font-weight: bold;"># </span><span style="color: #a0a1a7;">Jetzt wird 'Hallo' ausgegeben</span>
<span style="color: #a626a4;">print</span>(name)
</pre>
</div>

<p>
Variablen kann man genau so gut mit numerischen Literalen belegen.
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #8b4513;">zahl</span> = 42.0
<span style="color: #a626a4;">print</span>(zahl)
</pre>
</div>

<pre class="example">
42.0

</pre>

<p>
Zahlen können auch von Zeichenketten überschrieben werden
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #8b4513;">zahl</span> = <span style="color: #50a14f;">"Dies ist eine Zeichenkette"</span>
<span style="color: #a626a4;">print</span>(zahl)
</pre>
</div>

<pre class="example">
Dies ist eine Zeichenkette

</pre>

<p>
Pro-Tipp: Zeichenketten können auch mit dem einfachen Apostroph abgegrenzt werden.
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #a626a4;">print</span>(<span style="color: #50a14f;">'Wieder was gelernt'</span>)
</pre>
</div>

<pre class="example">
Wieder was gelernt

</pre>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Basisoperationen</h2>
<div class="outline-text-2" id="text-4">
<p>
Zahlen und Zeichenketten im Program zu haben ist ja schön und gut, aber was können wir damit anstellen? Mit Zahlen können wir z.B. rechnen, in der üblichen Schreibweise.
</p>

<p>
Hier ist es sehr hilfreich mit dem Debugger von Thonny zu arbeiten. Mit "Step into" (zweiter Pfeil neben dem Käfer) könnt ihr euch ganz genau ansehen, wie die einzelnen Befehle ausgewertet werden.
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #8b4513;">x</span> = 10
<span style="color: #8b4513;">y</span> = 20

<span style="color: #a626a4;">print</span>(x + y)

<span style="color: #8b4513;">z</span> = x + y

<span style="color: #a626a4;">print</span>(z + 2)
<span style="color: #a0a1a7; font-weight: bold;">#</span><span style="color: #a0a1a7;">print(2 * 2)</span>
<span style="color: #a0a1a7; font-weight: bold;">#</span><span style="color: #a0a1a7;">print(5 - 2)</span>
<span style="color: #a0a1a7; font-weight: bold;">#</span><span style="color: #a0a1a7;">print(12 / 4)</span>
<span style="color: #a0a1a7; font-weight: bold;">#</span><span style="color: #a0a1a7;">print(12 // 4)</span>

<span style="color: #a0a1a7; font-weight: bold;">#</span><span style="color: #a0a1a7;">print(13 % 5) # Modulo</span>
<span style="color: #a0a1a7; font-weight: bold;">#</span><span style="color: #a0a1a7;">print(4 ** 4)</span>
<span style="color: #a0a1a7; font-weight: bold;">#</span><span style="color: #a0a1a7;">print(0.1 + 0.2)</span>

<span style="color: #a0a1a7; font-weight: bold;">#</span><span style="color: #a0a1a7;">print(10 * (20 + 5)) # Ausdr&#252;cke k&#246;nnen beliebig geklammert werden</span>
</pre>
</div>

<p>
aasdfasdf
</p>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Kommentare</h2>
<div class="outline-text-2" id="text-5">
<p>
Alles hinter einem '#' wird von python ignoriert, so können wir Kommentare schreiben um Nachrichten an unser Zukunfts-Ich zu senden (uns Sachen zu merken)
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #a626a4;">print</span>(<span style="color: #50a14f;">"Moin world"</span>) <span style="color: #a0a1a7; font-weight: bold;"># </span><span style="color: #a0a1a7;">Dieser Funktionsaufruf gibt Text auf der Konsole aus.</span>
</pre>
</div>

<pre class="example">
Moin world

</pre>
</div>
</div>
</div><div class="col-md-3"><nav id="table-of-contents">
<div id="text-table-of-contents" class="bs-docs-sidebar">
<ul class="nav">
<li><a href="#sec-1">1. Hello World</a></li>
<li><a href="#sec-2">2. Datentypen</a></li>
<li><a href="#sec-3">3. Variablen</a></li>
<li><a href="#sec-4">4. Basisoperationen</a></li>
<li><a href="#sec-5">5. Kommentare</a></li>
</ul>
</div>
</nav>
</div></div></div>
<footer id="postamble" class="">
<div><p class="author">Author: Falco Winkler</p>
<p class="date">Created: 2019-05-17 Fri 00:20</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 26.1 (<a href="http://orgmode.org">Org-mode</a> 9.1.9)</p>
</div>
</footer>
</body>
</html>
